Improved README and added more detail about system design.
